src/InformationRegisters/СостояниеПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПриложения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МестонахождениеВещей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеВещей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вещь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыВещейИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВещейИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВещей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вещь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСобытийХроники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытийХроники</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Показания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пополнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияПоДолгу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавлениеДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПокупкаВещи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПокупкаВещи</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вещь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Вещи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вещи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВещей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВещей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МестаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МестаХранения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыНедвижимости</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Вещи/Ext/Module.bsl
// Сервис вещей (ARCHITECTURE §4, модуль Assets): быстрое добавление, перемещение,
// смена статуса, история (T-015). Место, дом и статус — текущие значения в самой вещи,
// их историю пишут события записи объекта; сервис только меняет поля и записывает объект.
// Тексты, видимые пользователю, — только по словарю (docs/GLOSSARY.md).

#Область ПрограммныйИнтерфейс

// Создаёт вещь с одним обязательным полем и возвращает ссылку на неё (UX_MAP §3.4).
// ОбработкаЗаполнения подставит статус и последнее использованное место.
//
// Параметры:
//  Наименование - Строка
//  Место - СправочникСсылка.МестаХранения - необязательно; если пропущено, подставится
//          последнее использованное место
//
// Возвращаемое значение:
//  СправочникСсылка.Вещи
//
Функция СоздатьВещь(Наименование, Место = Неопределено) Экспорт

	Если ПустаяСтрока(Наименование) Тогда
		ВызватьИсключение НСтр("ru = 'Укажите название — без него вещь не найти в поиске.'");
	КонецЕсли;

	// СоздатьЭлемент не вызывает ОбработкаЗаполнения: заполняем явно, как новая карточка.
	Вещь = Справочники.Вещи.СоздатьЭлемент();
	Вещь.Заполнить(Неопределено);
	Вещь.Наименование = Наименование;
	Если Место <> Неопределено Тогда
		Вещь.Место = Место;
		Если НЕ ЗначениеЗаполнено(Место) Тогда
			Вещь.ОбъектНедвижимости = Дома.ДомПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	Вещь.Записать();
	Возврат Вещь.Ссылка;

КонецФункции

// Перемещает вещь в другое место; дом вещи становится домом места.
// Если место не менялось — ничего не пишет.
//
// Параметры:
//  Вещь    - СправочникСсылка.Вещи
//  Место   - СправочникСсылка.МестаХранения
//  Заметка - Строка - попадёт в запись истории перемещения
//
Процедура ПереместитьВещь(Вещь, Место, Заметка = "") Экспорт

	Объект = Вещь.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Эта вещь уже не существует. Обновите список и попробуйте ещё раз.'");
	КонецЕсли;

	Если Объект.Место = Место Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПустаяСтрока(Заметка) Тогда
		Объект.ДополнительныеСвойства.Вставить("ЗаметкаИстории", Заметка);
	КонецЕсли;
	Объект.Место = Место;
	Объект.Записать();

КонецПроцедуры

// Меняет статус вещи. Если статус не менялся — ничего не пишет.
//
// Параметры:
//  Вещь    - СправочникСсылка.Вещи
//  Статус  - ПеречислениеСсылка.СтатусыВещей
//  Заметка - Строка - попадёт в запись истории статуса
//
Процедура ИзменитьСтатус(Вещь, Статус, Заметка = "") Экспорт

	Объект = Вещь.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Эта вещь уже не существует. Обновите список и попробуйте ещё раз.'");
	КонецЕсли;

	Если Объект.Статус = Статус Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ПустаяСтрока(Заметка) Тогда
		Объект.ДополнительныеСвойства.Вставить("ЗаметкаИстории", Заметка);
	КонецЕсли;
	Объект.Статус = Статус;
	Объект.Записать();

КонецПроцедуры

// Возвращает историю вещи по убыванию даты — для будущей вкладки «История» карточки.
//
// Параметры:
//  Вещь - СправочникСсылка.Вещи
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Период  - Дата
//   * Событие - Строка - «Перемещена: Кухня → Гараж», «Статус: Требует ремонта»
//   * Заметка - Строка
//
Функция ИсторияВещи(Вещь) Экспорт

	История = Новый ТаблицаЗначений;
	История.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	История.Колонки.Добавить("Событие", Новый ОписаниеТипов("Строка"));
	История.Колонки.Добавить("Заметка", Новый ОписаниеТипов("Строка"));

	ДобавитьМестонахождения(Вещь, История);
	ДобавитьСтатусы(Вещь, История);
	История.Сортировать("Период УБЫВ");

	Возврат История;

КонецФункции

// Возвращает место, использованное последним: существующее и не в архиве.
// Пустая ссылка — если такого места нет.
//
// Возвращаемое значение:
//  СправочникСсылка.МестаХранения
//
Функция ПоследнееМесто() Экспорт

	Идентификатор = Миграции.ЗначениеСостояния(КлючПоследнегоМеста());
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Справочники.МестаХранения.ПустаяСсылка();
	КонецЕсли;

	Попытка
		Место = Справочники.МестаХранения.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		// Повреждённое значение (например, после восстановления копии): считаем, что выбора не было.
		Возврат Справочники.МестаХранения.ПустаяСсылка();
	КонецПопытки;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Ссылка = &Ссылка
	|	И НЕ МестаХранения.ПометкаУдаления
	|	И НЕ МестаХранения.Архив";
	Запрос.УстановитьПараметр("Ссылка", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.МестаХранения.ПустаяСсылка();

КонецФункции

// Запоминает место как использованное последним (ключ «ПоследнееМесто»).
//
// Параметры:
//  Место - СправочникСсылка.МестаХранения
//
Процедура ЗапомнитьПоследнееМесто(Место) Экспорт

	Если Место.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.СостояниеПриложения.СоздатьМенеджерЗаписи();
	Запись.Ключ = КлючПоследнегоМеста();
	Запись.Значение = Строка(Место.УникальныйИдентификатор());
	Запись.Записать(Истина);

КонецПроцедуры

// Синхронизирует единственный документ покупки вещи с полями карточки (METADATA §2.4:
// поля покупки вещи — кэш документа). Вызывается при записи вещи; если все поля пусты,
// документ и его события удаляются. Документ не пишет обратно в вещь — рекурсии нет.
//
// Параметры:
//  Вещь - СправочникСсылка.Вещи
//
Процедура ОбновитьПокупку(Вещь) Экспорт

	Покупка = НайтиПокупку(Вещь);
	Данные = ДанныеПокупкиВещи(Вещь);

	Если Покупка = Неопределено И НЕ Данные.Заполнены Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Если НЕ Данные.Заполнены Тогда
			УдалитьПокупку(Покупка);
		Иначе
			ЗаписатьПокупку(Покупка, Вещь, Данные);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Обновляет событие покупки после смены дома вещи: событие покупки несёт дом вещи,
// поэтому при перемещении оно должно совпасть с перестроенным (ADR-003).
//
// Параметры:
//  Вещь - СправочникСсылка.Вещи
//
Процедура ОбновитьСобытияПокупки(Вещь) Экспорт

	Покупка = НайтиПокупку(Вещь);
	Если Покупка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Хроника.ОбновитьПоИсточнику(Покупка, СобытияПокупки(Покупка));
	Вложения.ОбновитьСобытияПоПредмету(Покупка);

КонецПроцедуры

// События одной вещи для истории: перемещения и смены статуса. Источник — вещь.
// Строятся одной функцией и при записи, и при перестроении, поэтому перестроенная
// история совпадает с накопленной (ADR-003).
//
// Параметры:
//  Вещь - СправочникСсылка.Вещи
//
// Возвращаемое значение:
//  Массив структур, см. Хроника.НовоеСобытие
//
Функция СобытияВещи(Вещь) Экспорт

	События = Новый Массив;
	ДобавитьСобытияПеремещений(Вещь, События);
	ДобавитьСобытияСтатусов(Вещь, События);
	Возврат События;

КонецФункции

// События одной покупки: «Купили» с ценой, валютой и продавцом. Источник — документ.
//
// Параметры:
//  Покупка - ДокументСсылка.ПокупкаВещи
//
// Возвращаемое значение:
//  Массив структур, см. Хроника.НовоеСобытие
//
Функция СобытияПокупки(Покупка) Экспорт

	События = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПокупкаВещи.Ссылка КАК Ссылка,
	|	ПокупкаВещи.Дата КАК Дата,
	|	ПокупкаВещи.Сумма КАК Сумма,
	|	ПокупкаВещи.Валюта КАК Валюта,
	|	ПокупкаВещи.Продавец КАК Продавец,
	|	ПокупкаВещи.Вещь КАК Вещь,
	|	Вещи.ОбъектНедвижимости КАК ОбъектНедвижимости
	|ИЗ
	|	Документ.ПокупкаВещи КАК ПокупкаВещи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вещи КАК Вещи
	|		ПО ПокупкаВещи.Вещь = Вещи.Ссылка
	|ГДЕ
	|	ПокупкаВещи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Покупка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат События;
	КонецЕсли;

	Событие = Хроника.НовоеСобытие(Перечисления.ТипыСобытийХроники.Покупка,
		НСтр("ru = 'Купили'"), Выборка.Дата);
	Событие.Описание = Выборка.Продавец;
	Событие.Сумма = Выборка.Сумма;
	Событие.Валюта = Выборка.Валюта;
	Событие.Источник = Выборка.Ссылка;
	Событие.Объект = Выборка.Вещь;
	Событие.ОбъектНедвижимости = Выборка.ОбъектНедвижимости;
	События.Добавить(Событие);

	Возврат События;

КонецФункции

// Все события вещей и их покупок — для перестроения истории (ADR-003).
//
// Возвращаемое значение:
//  Массив структур, см. Хроника.НовоеСобытие
//
Функция СобытияДляХроники() Экспорт

	События = Новый Массив;

	Запрос = Новый Запрос("ВЫБРАТЬ Вещи.Ссылка КАК Ссылка ИЗ Справочник.Вещи КАК Вещи");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСобытия(События, СобытияВещи(Выборка.Ссылка));
	КонецЦикла;

	Запрос = Новый Запрос("ВЫБРАТЬ ПокупкаВещи.Ссылка КАК Ссылка ИЗ Документ.ПокупкаВещи КАК ПокупкаВещи");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСобытия(События, СобытияПокупки(Выборка.Ссылка));
	КонецЦикла;

	Возврат События;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет историю перемещениями вещи. Записи читаются по возрастанию даты,
// поэтому каждая знает предыдущее место: «Перемещена: Кухня → Гараж».
Процедура ДобавитьМестонахождения(Вещь, История)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестонахождениеВещей.Период КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеВещей.Место) КАК МестоПредставление,
	|	МестонахождениеВещей.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.МестонахождениеВещей КАК МестонахождениеВещей
	|ГДЕ
	|	МестонахождениеВещей.Вещь = &Вещь
	|УПОРЯДОЧИТЬ ПО
	|	МестонахождениеВещей.Период";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьПредыдущее = Ложь;
	ПредыдущееМесто = "";
	Пока Выборка.Следующий() Цикл
		Если ЕстьПредыдущее Тогда
			Событие = СтрШаблон(НСтр("ru = 'Перемещена: %1 → %2'"), ПредыдущееМесто, Выборка.МестоПредставление);
		Иначе
			Событие = СтрШаблон(НСтр("ru = 'Перемещена: %1'"), Выборка.МестоПредставление);
		КонецЕсли;
		СтрокаИстории = История.Добавить();
		СтрокаИстории.Период = Выборка.Период;
		СтрокаИстории.Событие = Событие;
		СтрокаИстории.Заметка = Выборка.Заметка;
		ЕстьПредыдущее = Истина;
		ПредыдущееМесто = Выборка.МестоПредставление;
	КонецЦикла;

КонецПроцедуры

// Заполняет историю сменами статуса вещи: «Статус: Требует ремонта».
Процедура ДобавитьСтатусы(Вещь, История)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыВещейИстория.Период КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(СтатусыВещейИстория.Статус) КАК СтатусПредставление,
	|	СтатусыВещейИстория.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.СтатусыВещейИстория КАК СтатусыВещейИстория
	|ГДЕ
	|	СтатусыВещейИстория.Вещь = &Вещь
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыВещейИстория.Период";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаИстории = История.Добавить();
		СтрокаИстории.Период = Выборка.Период;
		СтрокаИстории.Событие = СтрШаблон(НСтр("ru = 'Статус: %1'"), Выборка.СтатусПредставление);
		СтрокаИстории.Заметка = Выборка.Заметка;
	КонецЦикла;

КонецПроцедуры

// Поля покупки вещи и признак, что хотя бы одно из них заполнено.
Функция ДанныеПокупкиВещи(Вещь)

	Данные = Новый Структура;
	Данные.Вставить("Заполнены", Ложь);
	Данные.Вставить("ДатаПокупки", Дата(1, 1, 1));
	Данные.Вставить("ЦенаПокупки", 0);
	Данные.Вставить("Валюта", "");
	Данные.Вставить("Продавец", "");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Вещи.ДатаПокупки КАК ДатаПокупки,
	|	Вещи.ЦенаПокупки КАК ЦенаПокупки,
	|	Вещи.Валюта КАК Валюта,
	|	Вещи.Продавец КАК Продавец
	|ИЗ
	|	Справочник.Вещи КАК Вещи
	|ГДЕ
	|	Вещи.Ссылка = &Вещь";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Данные;
	КонецЕсли;

	Данные.ДатаПокупки = Выборка.ДатаПокупки;
	Данные.ЦенаПокупки = Выборка.ЦенаПокупки;
	Данные.Валюта = Выборка.Валюта;
	Данные.Продавец = Выборка.Продавец;
	Данные.Заполнены = ЗначениеЗаполнено(Выборка.ДатаПокупки)
		Или ЗначениеЗаполнено(Выборка.ЦенаПокупки)
		Или НЕ ПустаяСтрока(Выборка.Продавец);
	Возврат Данные;

КонецФункции

// Существующий документ покупки вещи; Неопределено, если его нет.
Функция НайтиПокупку(Вещь)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПокупкаВещи.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПокупкаВещи КАК ПокупкаВещи
	|ГДЕ
	|	ПокупкаВещи.Вещь = &Вещь
	|УПОРЯДОЧИТЬ ПО
	|	ПокупкаВещи.Дата";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Создаёт или обновляет документ покупки; пишет только при изменениях значений.
Процедура ЗаписатьПокупку(Покупка, Вещь, Данные)

	Если Покупка = Неопределено Тогда
		Документ = Документы.ПокупкаВещи.СоздатьДокумент();
	Иначе
		Документ = Покупка.ПолучитьОбъект();
		Если Документ = Неопределено Тогда
			Документ = Документы.ПокупкаВещи.СоздатьДокумент();
		КонецЕсли;
	КонецЕсли;

	ДатаДокумента = ДатаПокупкиДокумента(Данные.ДатаПокупки, Документ);
	Валюта = ?(ПустаяСтрока(Данные.Валюта), Константы.ОсновнаяВалюта.Получить(), Данные.Валюта);

	НужноЗаписать = Документ.ЭтоНовый();
	Если Документ.Дата <> ДатаДокумента Тогда
		Документ.Дата = ДатаДокумента;
		НужноЗаписать = Истина;
	КонецЕсли;
	Если Документ.Вещь <> Вещь Тогда
		Документ.Вещь = Вещь;
		НужноЗаписать = Истина;
	КонецЕсли;
	Если Документ.Сумма <> Данные.ЦенаПокупки Тогда
		Документ.Сумма = Данные.ЦенаПокупки;
		НужноЗаписать = Истина;
	КонецЕсли;
	Если Документ.Валюта <> Валюта Тогда
		Документ.Валюта = Валюта;
		НужноЗаписать = Истина;
	КонецЕсли;
	Если Документ.Продавец <> Данные.Продавец Тогда
		Документ.Продавец = Данные.Продавец;
		НужноЗаписать = Истина;
	КонецЕсли;

	Если НужноЗаписать Тогда
		Документ.Записать();
	КонецЕсли;

КонецПроцедуры

// Дата документа покупки: дата покупки, иначе — уже сохранённая дата, иначе текущая.
// Пустая дата покупки не должна переписывать документ при каждом сохранении вещи.
Функция ДатаПокупкиДокумента(ДатаПокупки, Документ)

	Если ЗначениеЗаполнено(ДатаПокупки) Тогда
		Возврат ДатаПокупки;
	КонецЕсли;
	Если НЕ Документ.ЭтоНовый() Тогда
		Возврат Документ.Дата;
	КонецЕсли;
	Возврат ТекущаяДатаСеанса();

КонецФункции

// Удаляет документ покупки и его события истории.
Процедура УдалитьПокупку(Покупка)

	Если Покупка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Документ = Покупка.ПолучитьОбъект();
	Если Документ <> Неопределено Тогда
		Документ.Удалить();
	КонецЕсли;
	Хроника.УдалитьПоИсточнику(Покупка);

КонецПроцедуры

// События перемещений: первая запись вещи — «Положили», следующие — «Перенесли».
Процедура ДобавитьСобытияПеремещений(Вещь, События)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестонахождениеВещей.Период КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеВещей.Место) КАК МестоПредставление,
	|	МестонахождениеВещей.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	МестонахождениеВещей.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.МестонахождениеВещей КАК МестонахождениеВещей
	|ГДЕ
	|	МестонахождениеВещей.Вещь = &Вещь
	|УПОРЯДОЧИТЬ ПО
	|	МестонахождениеВещей.Период";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();

	Первая = Истина;
	Пока Выборка.Следующий() Цикл
		Действие = ?(Первая, НСтр("ru = 'Положили'"), НСтр("ru = 'Перенесли'"));
		Заголовок = Действие + ?(ПустаяСтрока(Выборка.МестоПредставление), "",
			": " + Выборка.МестоПредставление);
		Событие = Хроника.НовоеСобытие(Перечисления.ТипыСобытийХроники.Перемещение,
			Заголовок, Выборка.Период);
		Событие.Описание = Выборка.Заметка;
		Событие.Источник = Вещь;
		Событие.Объект = Вещь;
		Событие.ОбъектНедвижимости = Выборка.ОбъектНедвижимости;
		События.Добавить(Событие);
		Первая = Ложь;
	КонецЦикла;

КонецПроцедуры

// События смены статуса: первая запись вещи — начальный статус, события не даёт.
Процедура ДобавитьСобытияСтатусов(Вещь, События)

	ОбъектНедвижимости = Вещь.ОбъектНедвижимости;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыВещейИстория.Период КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(СтатусыВещейИстория.Статус) КАК СтатусПредставление,
	|	СтатусыВещейИстория.Заметка КАК Заметка
	|ИЗ
	|	РегистрСведений.СтатусыВещейИстория КАК СтатусыВещейИстория
	|ГДЕ
	|	СтатусыВещейИстория.Вещь = &Вещь
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыВещейИстория.Период";
	Запрос.УстановитьПараметр("Вещь", Вещь);
	Выборка = Запрос.Выполнить().Выбрать();

	Первая = Истина;
	Пока Выборка.Следующий() Цикл
		Если Первая Тогда
			Первая = Ложь;
			Продолжить;
		КонецЕсли;
		Заголовок = СтрШаблон(НСтр("ru = 'Статус: %1'"), Выборка.СтатусПредставление);
		Событие = Хроника.НовоеСобытие(Перечисления.ТипыСобытийХроники.ИзменениеСтатуса,
			Заголовок, Выборка.Период);
		Событие.Описание = Выборка.Заметка;
		Событие.Источник = Вещь;
		Событие.Объект = Вещь;
		Событие.ОбъектНедвижимости = ОбъектНедвижимости;
		События.Добавить(Событие);
	КонецЦикла;

КонецПроцедуры

// Копирует события одного источника в общий массив.
Процедура ДобавитьСобытия(Приемник, ИсточникСобытий)

	Для Каждого Событие Из ИсточникСобытий Цикл
		Приемник.Добавить(Событие);
	КонецЦикла;

КонецПроцедуры

Функция КлючПоследнегоМеста()

	Возврат "ПоследнееМесто";

КонецФункции

#КонецОбласти
